{
    "name": "Kagome",
    "title": "The Spiritual Archer",
    "subtitle": "A powerful priestess who wields sacred arrows",
    "lore": "A skilled archer with spiritual powers, Kagome possesses the unique ability to manipulate souls and spiritual energy. Her mastery over sacred arrows and spiritual techniques makes her a formidable opponent, capable of both dealing devastating damage and outmaneuvering her enemies through spiritual projection.",
    "stats": {
        "AD": {
            "base": 65,
            "growth": 10,
            "max": 305,
            "type": "Physical"
        },
        "HP": {
            "base": 583,
            "growth": 263,
            "max": 6895,
            "type": "Health"
        },
        "Mana": {
            "base": 388,
            "growth": 30,
            "max": 1108,
            "type": "Resource"
        },
        "Movement Speed": {
            "base": 369,
            "growth": 3,
            "max": 441,
            "type": "Mobility"
        },
        "Attack Speed": {
            "base": 0.62,
            "growth": 0.032,
            "max": 1.39,
            "type": "Combat"
        }
    },
    "abilities": {
        "P": {
            "name": "Spirit Walk",
            "description": "When Kagome dies, her spirit can travel on the map. When she revives, she revives at her spirit's place.",
            "type": "Passive"
        },
        "Q": {
            "name": "Burst Arrow",
            "description": "When activated, Kagome's next autoattack deals 100%(100%AD + 100% Magic damage) bonus magic damage. This ability can reset autoattacks.",
            "cost": "10 Mana",
            "cooldown": "10/8/8/7/4s"
        },
        "W": {
            "name": "Soul Arrows",
            "description": "Kagome shoots 4 arrows in the targeted direction at the same time next to each other. If an arrow hits an enemy, it penetrates into their soul, slowing them by 45% for 2.5s and dealing 65/110/170/300/390 damage.",
            "cost": "75 Mana",
            "cooldown": "9s/8s/7s/7s/6s"
        },
        "E": {
            "name": "Psyche Image",
            "description": "Kagome leaves her body gaining 85% damage reduction and able to walk away from her body in stealth for 2s/2s/2s/3s/3s. When the duration ends or the spell is pressed again, Kagome teleports her body to the soul's place losing the damage reduction buff. During Psyche Image, Kagome can't use spells nor attack.",
            "cost": "95 Mana",
            "cooldown": "28s/23s/18s/16s/15s"
        },
        "R": {
            "name": "Anima Scream",
            "description": "Kagome disables all positive buffs from every enemy around her except damage reduction and magic shield. This ability also deals 370/470/575 damage to each enemy hit.",
            "cost": "100 Mana",
            "cooldown": "180s"
        }
    },
    "talents": {
        "1": [
            {
                "name": "Spectral Huntress",
                "description": "While in Psyche Image, Kagome gains 30% increased movement speed and can see enemy champions within a large radius, even in stealth. Psyche Image cooldown is decreased by 5s"
            },
            {
                "name": "Empowered Arrows",
                "description": "Burst Arrow now chains to up to two additional nearby enemies near the target, dealing 50% of the original damage to each."
            },
            {
                "name": "Soul Link",
                "description": "Psyche Image now autoattacks automatically."
            }
        ],
        "5": [
            {
                "name": "Piercing Souls",
                "description": "Arrows now travel through enemies and the slow duration is extended by 1s"
            },
            {
                "name": "Spiritual Armor",
                "description": "Kagome gains 5% magic resistance shield. It goes up to 9% when she is below 22% health."
            },
            {
                "name": "Focus of the Spirit",
                "description": "Autoattacks restore 10% of missing mana. Additionally, your auto attacks deal bonus [10%] magic damage."
            }
        ],
        "10": [
            {
                "name": "Soul Shatter",
                "description": "Anima Scream now also applies a 30% healing reduction to all affected enemies for 2 seconds"
            },
            {
                "name": "Eternal Torment",
                "description": "Anima Scream's radius is increased by 30%, and its cooldown is reduced by 60 seconds. Additionally, enemies hit by Anima Scream are silenced for 0.5 seconds."
            }
        ],
        "15": [
            {
                "name": "Quick Draw",
                "description": "using Burst Arrow grants Kagome 0.3 increased attack speed for 2 seconds"
            },
            {
                "name": "Haunting Presence",
                "description": "Kagome's clone casts Soul Arrows around herself when it disappears."
            },
            {
                "name": "Soulfire Arrows",
                "description": "Soul Arrows now ignite enemies hit, dealing [35/40/55] magic damage for [5s] every [1s]. This can stack up [3] times"
            }
        ],
        "20": [
            {
                "name": "Vengeful Spirit",
                "description": "After reviving from Spirit Walk, Kagome gains a 50% damage buff for 5 seconds and becomes immune to crowd control effects during this time."
            },
            {
                "name": "Spectral Assault",
                "description": "Auto-attacks deal bonus magic damage equal to 3.5% of the target's missing health."
            },
            {
                "name": "Spirit Link",
                "description": "Activating Psyche Image now automatically triggers Anima Scream at the original body's location before the teleport occurs in a small area."
            },
            {
                "name": "Echoing Screams",
                "description": "Anima Scream gains a second charge."
            }
        ]
    },
    "playstyle": {
        "role": "Marksman",
        "difficulty": "Moderate",
        "damage_type": "Mixed",
        "strengths": [
            "High single-target damage",
            "Strong mobility through spirit form",
            "Powerful utility with slows and buff removal",
            "Unique revival mechanic"
        ],
        "weaknesses": [
            "Mana dependent",
            "Vulnerable when Psyche Image is on cooldown",
            "Requires good positioning",
            "Limited defensive options"
        ]
    }
} 