{
    "name": "Mega Man",
    "title": "Hero of The Cyber World",
    "subtitle": "A robotic defender equipped with adaptable combat technology",
    "lore": "Mega Man is a powerful robotic hero designed to protect the cyber world. With his advanced technology and array of weapons, he fights against various threats. His ability to adapt to different situations with his upgradable systems makes him a formidable champion in any battle.",
    "stats": {
        "AD": {
            "base": 58,
            "growth": 6,
            "max": 202,
            "type": "RANGED"
        },
        "HP": {
            "base": 592,
            "growth": 232,
            "max": 6160
        },
        "Mana": {
            "base": 444,
            "growth": 44,
            "max": 1500
        },
        "Movement Speed": {
            "base": 333,
            "growth": 4.2,
            "max": 434
        },
        "Attack Speed": {
            "base": 0.56,
            "growth": 0.023,
            "max": 1.11
        }
    },
    "abilities": {
        "passive": {
            "name": "Loading Boosters",
            "description": "Mega Man gains the following boosters when he reaches different objectives: Take 100 cs: +50 AD, Reach LvL10: Gains an item that reduces a chosen ability cooldown by 2s, Take 3 towers as a team: Gains 1 level advantage (can reach lvl 26), Kill 10 enemies: Armor upgrades to take 5% less damage from all sources, Travel 30000 miles: Gains a jetpack that increases movement speed by 65.",
            "type": "Passive"
        },
        "Q": {
            "name": "Pixel Beam",
            "description": "Mega Man shoots a beam to the targeted direction which deals [50/100/180/290/380] as magic damage.",
            "cost": "40 Mana",
            "cooldown": "6s/6s/5s/4s/4s"
        },
        "W": {
            "name": "Upgraded Magic Shooter",
            "description": "Mega Man gains [0.2/0.25/0.4/0.5/0.55] AS and all of Mega Man's autoattacks and Q abilities deal bonus [15/25/30/35/50] magic damage with each attack. Duration: 5s",
            "cost": "0 Mana",
            "cooldown": "20s/18s/17s/17s/15s"
        },
        "E": {
            "name": "Dimension Jump",
            "description": "Mega Man instantly teleports to the targeted nearby place.",
            "cost": "100 Mana",
            "cooldown": "17s/15s/14s/12s/11s"
        },
        "R": {
            "name": "Loading: Digital Sword",
            "description": "Mega Man changes his cannon shooter to a sword, enabling him to attack in melee state. All melee attacks deal [200%AD] magic damage and ignore magic shield. Mega Man also gains [+50] MS for the duration. Duration: 15s + [5s/kill during duration]",
            "cost": "100 Mana",
            "cooldown": "100s"
        }
    },
    "talents": {
        "1": [
            {
                "name": "Enhanced Pixel Beam",
                "description": "Pixel Beam pierces through enemies, hitting any targets within range."
            },
            {
                "name": "Rocket Charge",
                "description": "Dimension Jump grants a shield equal to 15% of Mega Man's maximum HP for 3 seconds after teleporting."
            },
            {
                "name": "Adaptive Circuitry",
                "description": "Upon reaching 50% HP, Mega Man's Upgraded Magic Shooter automatically activates without a cooldown, once every 30 seconds."
            }
        ],
        "5": [
            {
                "name": "Energy Recoil",
                "description": "Pixel Beam slows the enemy by 20% for 1.5 seconds if they are hit."
            },
            {
                "name": "Overcharged Shooter",
                "description": "The bonus magic damage from Upgraded Magic Shooter is increased to 25%."
            },
            {
                "name": "Blink Strike",
                "description": "After using Dimension Jump, Mega Man's next auto-attack deals bonus 30% magic damage."
            }
        ],
        "10": [
            {
                "name": "Digital Frenzy",
                "description": "While Digital Sword is active, every kill increases attack speed by 15% and extends the duration by 5 seconds."
            },
            {
                "name": "Power Slash",
                "description": "Digital Sword now cleaves, dealing 50% of its damage in a small area around the target."
            }
        ],
        "15": [
            {
                "name": "Dimensional Surge",
                "description": "Dimension Jump cooldown is reduced by 3 seconds when you land a kill or assist."
            },
            {
                "name": "Overdrive Assault",
                "description": "Upgraded Magic Shooter now also increases Mega Man's movement speed by 20% during its effect."
            },
            {
                "name": "Piercing Beam",
                "description": "Pixel Beam deals an additional 5% of the enemy's missing health as bonus damage."
            }
        ],
        "20": [
            {
                "name": "Digital Ascension",
                "description": "The Loading Boosters passive now includes an additional boost—after taking 1000 more miles, gain immunity to slows and roots."
            },
            {
                "name": "Ultimate Upgrade",
                "description": "Digital Sword gains 20% more attack speed, and kills during the ability's duration fully reset its cooldown."
            },
            {
                "name": "Dimension Master",
                "description": "Dimension Jump can be used twice within 3 seconds before going on cooldown."
            },
            {
                "name": "Master Overclock",
                "description": "Reaching level 26 grants a second ability that can be chosen to benefit from the 2-second cooldown reduction from the Loading Boosters passive. This time it reduces both abilities by 3s instead of 2s."
            }
        ]
    },
    "playstyle": {
        "difficulty": "Medium",
        "role": "Mage",
        "damage_type": "Magical",
        "strengths": [
            "High ability damage",
            "Good mobility",
            "Versatile abilities",
            "Scales well into late game"
        ],
        "weaknesses": [
            "Mana dependent",
            "Vulnerable when abilities are on cooldown",
            "Relies on skillshots",
            "Needs to reach objectives to maximize passive"
        ]
    }
} 