{
    "name": "Sophitia",
    "title": "The Holy Warrior",
    "subtitle": "A divine warrior who combines holy power with sword and shield techniques",
    "lore": "A chosen warrior blessed by the gods, Sophitia wields her divine powers to protect the innocent. Her mastery of sword and shield, combined with her holy blessings, makes her a formidable defender. Despite her gentle nature, she fights with unwavering determination to maintain the balance between the mortal and divine realms.",
    "stats": {
        "AD": {
            "base": 50,
            "growth": 4.5,
            "max": 158,
            "type": "MELEE"
        },
        "HP": {
            "base": 622,
            "growth": 339,
            "max": 8758
        },
        "Mana": {
            "base": 311,
            "growth": 80,
            "max": 2231
        },
        "Movement Speed": {
            "base": 320,
            "growth": 3.5,
            "max": 404
        },
        "Attack Speed": {
            "base": 0.43,
            "growth": 0.055,
            "max": 1.75
        }
    },
    "abilities": {
        "passive": {
            "name": "Divine Blessing",
            "description": "Sophitia gains bonuses based on her current HP:\n100-95% HP: +2/4/8/12/18 AD\n94%-80% HP: +3/4/5/6/8 Mana regen/s\n79%-50% HP: Reduces crowd control time by 0.2/0.3/0.35/0.5/0.7 seconds",
            "type": "Passive"
        },
        "Q": {
            "name": "Holy Strike",
            "description": "Sophitia swings her sword twice in front of her. Each hit deals [45/100/165/275/350 + 40% AD] damage. If the target is affected by the bleed from her W ability, Sophitia heals for [40%] of the damage dealt and refreshes the bleed duration.",
            "cost": "90 Mana",
            "cooldown": "13/12/11/10/9s"
        },
        "W": {
            "name": "Sting",
            "description": "Sophitia stabs a nearby enemy with her sword, immediately slowing them by [60%] for [3.5s] and dealing [10/14/20/28/33] damage every [0.5s] during the slow.",
            "cost": "90 Mana",
            "cooldown": "15s/13s/10s/9s/9s"
        },
        "E": {
            "name": "Shield of Faith",
            "description": "Sophitia raises her shield in a defensive stance, creating a large protective wall in front of her that absorbs all incoming damage for [3s]. When the wall expires, it sends out a wave that stuns all enemies in front of her for [0.6s]. Expiration can be earlier if the ability is pressed again. During this ability, Sophitia cannot use her Q and W abilities.",
            "cost": "80 Mana",
            "cooldown": "20/17/17/15/14s"
        },
        "R": {
            "name": "Prayer",
            "description": "Sophitia's HP regeneration increases to [200/340/500] per second for [5s].",
            "cost": "0 Mana",
            "cooldown": "170/140/120s"
        }
    },
    "talents": {
        "1": [
            {
                "name": "Holy Warrior",
                "description": "Increase the bonuses from Sophitia's passive by 15%. Additionally, her attack speed increases by 0.1 when her health is above 95%."
            },
            {
                "name": "Divine Strike",
                "description": "Sophitia's Q ability now also reduces the cooldown of her W by 1 second per hit. Additionally, hitting an enemy with Q restores 5% of her maximum mana."
            },
            {
                "name": "Guardian's Path",
                "description": "Sophitia's E ability also grants a shield to nearby allies and herself, absorbing 20% of the damage she absorbs for [2s]."
            }
        ],
        "5": [
            {
                "name": "Aegis Mastery",
                "description": "Reduces the cooldown of E by 3 seconds and increases the duration of the defensive wall by 1 second."
            },
            {
                "name": "Valorous Might",
                "description": "Increases Sophitia's basic attack damage by 15% and grants 5% lifesteal."
            },
            {
                "name": "Blessed Recovery",
                "description": "Increases the effectiveness of healing received by 25% when Sophitia's health is below 35%."
            }
        ],
        "10": [
            {
                "name": "Divine Endurance",
                "description": "Increases the duration of Sophitia's R ability by 2 seconds and grants her 30% damage reduction while it is active."
            },
            {
                "name": "Sacred Renewal",
                "description": "While R is active, Sophitia radiates an aura that heals nearby allies for 15% of the healing she receives from her R."
            }
        ],
        "15": [
            {
                "name": "Sharp Edge",
                "description": "Sophitia's Q ability now causes enemies to bleed for an additional 50% of the damage dealt."
            },
            {
                "name": "Persistent Will",
                "description": "Reduces the cooldown of all abilities by 0.5 second every time Sophitia hits an enemy with her basic attacks."
            },
            {
                "name": "Blessing of Athena",
                "description": "Using any ability grants Sophitia a shield that absorbs damage equal to 5% of her maximum health for 5 seconds."
            }
        ],
        "20": [
            {
                "name": "Divine Intervention",
                "description": "When Sophitia falls below 14% health, she becomes immune to spells for 2 seconds. This effect has a 120-second cooldown."
            },
            {
                "name": "Retribution Strike",
                "description": "Sophitia's Q now strikes three times instead of two and the healing from the bleed effect is increased to 65% of the damage dealt."
            },
            {
                "name": "Sanctified Barrier",
                "description": "Defensive Wall reflecting the negated damage to the attacker by [5%] of the negated damage."
            },
            {
                "name": "Celestial Empowerment",
                "description": "All of Sophitia's abilities gain an additional effect:\nQ: Hitting an enemy reduces their armor by 3% for 3 seconds.\nW: The slow and bleed effect lasts an additional 1 second.\nE: Sophitia is immune to CC while holding the shield."
            }
        ]
    },
    "playstyle": {
        "difficulty": "Medium",
        "role": "Tank",
        "damage_type": "Physical",
        "strengths": [
            "Strong defensive abilities",
            "Good sustain",
            "Effective crowd control",
            "Versatile passive bonuses"
        ],
        "weaknesses": [
            "Mana intensive",
            "Limited mobility",
            "Vulnerable when abilities are on cooldown",
            "Requires good timing of defensive abilities"
        ]
    }
} 